{"id":"8","awardCategory":"PMO Awards","titleBarTitle":"PMI PMO of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI PMO of the Year Award","aboutText":"The PMI PMO of the Year Award honors a PMO that has demonstrated superior organizational project management abilities by adding value to its organization through its support of successful strategic initiatives. The award recognizes a PMO that has established a vision for value delivery and has had a positive and clear impact on business results. ","links":[{"linkUrl":"https://www.uhhospitals.org/","linkLabel":"Website"},{"linkUrl":"https://www.linkedin.com/company/university-hospitals/","linkLabel":"LinkedIn"},{"linkUrl":"https://www.instagram.com/uhhospitals_cle/?hl=en","linkLabel":"Instagram"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"University Hospitals Enterprise Program Management Office","subtitle":"University Hospitals","leadVideo":null,"leadImage":null,"description":["University Hospitals’ EPMO is headed by the VP of Operational Effectiveness for the specific purpose of supporting the successful collaboration and delivery of University Hospitals operational and strategic initiatives. The EPMO was created to serve as a centralized service across the organization, as well as a vehicle to distribute a unified and structured approach to the disciplines of Project, Program, and Portfolio Management. Industry experience has shown that most projects/programs are inherently at risk, missing on time, scope, cost, and/or failing to deliver a successful outcome. The EPMO approach aims to maximize positive change while implementing minimal process to serve the specific culture and needs of the organization while also operating as a ‘best in class’ EPMO."],"images":[{"imageFilename":"ex8_img1_uhrainbow.jpg","imageCaption":"New UH Rainbow Perrico Center."},{"imageFilename":"ex8_img2_glenville.jpg","imageCaption":"New Glenville Wellness Center."},{"imageFilename":"ex8_img3_newmayfield.png","imageCaption":"New Mayfield Heights Urgent Care Center"},{"imageFilename":"ex8_img4_teampicture.jpg","imageCaption":"The EMPO team."}],"creditGrid":[]}