{"id":"5","awardCategory":"Project Awards","titleBarTitle":"PMI Project of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI Project of the Year Award","aboutText":"The PMI Project of the Year Award, PMI Large and Mega Project Award, and PMI Small and Mid-Size Project Award recognize complex projects that best deliver superior performance of project management practices, expert organizational results, and positive impacts on society.","links":[{"linkUrl":"www.nbbonline.com","linkLabel":"Website"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"The National Bank of Bahrain’s Transformation Project - Tylos","subtitle":"The National Bank of Bahrain, TATA consultancy services, Accenture Consulting Firm","leadVideo":null,"leadImage":null,"description":["The Tylos project was a remarkable triumph, replacing core banking systems in the United Arab Emirates, Saudi Arabia, and Bahrain within four years, despite COVID-19 challenges. Overcoming obstacles like custom software versions and integrating 40 peripheral systems in Bahrain, it was executed efficiently. Key success factors included seamless collaboration between the National Bank of Bahrain (NBB) and partners, with over 100 weekly Steering Committee meetings for alignment. An effective communication strategy raised awareness and maintained positive relationships. Despite the high-risk approach, the programme was a resounding success with no operational disruptions. Identified issues were promptly addressed, causing minimal disturbance. The Tylos project showcased the effectiveness of teamwork, governance, and communication in complex transformations, highlighting NBB's commitment to excellence and innovation."],"images":[{"imageFilename":"1_6B8347F2-F131-4DE1-A54A-FBCA5C8AA8E4 - Dana Abul.jpeg","imageCaption":"Group effort"},{"imageFilename":"2_72F3FEF1-1B70-449C-A3A7-023A2B23F38E - Dana Abul.jpeg","imageCaption":"Team meeting"},{"imageFilename":"3_ED0479BC-2ED9-4542-9886-CB4A45F5FBAD - Dana Abul.jpeg","imageCaption":"Team in action"},{"imageFilename":"4_A1E8CC0C-B23B-4814-9B5E-3A3F506BDC2F - Dana Abul.jpeg","imageCaption":"Team in action"},{"imageFilename":"5_A24FCCF4-CC5E-4707-AE73-2858FB8983A4 - Dana Abul.jpeg","imageCaption":"In action"}],"creditGrid":[{"creditName":"Vittal Anaantatmula, DSc, PMP","creditDescription":"Professor, Western Carolina University","creditLocation":"Cullowhee, North Carolina, USA"},{"creditName":"Frank Anbari, PhD, PMP","creditDescription":"Professor Emeritus, Drexel University","creditLocation":"Philadelphia, Pennsylvania, USA"}]}