{"id":"10","awardCategory":"PMO Awards","titleBarTitle":"PMI PMO of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI PMO of the Year Award","aboutText":"The PMI PMO of the Year Award honors a PMO that has demonstrated superior organizational project management abilities by adding value to its organization through its support of successful strategic initiatives. The award recognizes a PMO that has established a vision for value delivery and has had a positive and clear impact on business results. ","links":[{"linkUrl":"https://zatca.gov.sa/en/Pages/default.aspx","linkLabel":"Website"},{"linkUrl":"https://www.linkedin.com/company/zatca_sa/mycompany/verification/","linkLabel":"LinkedIn"},{"linkUrl":"https://twitter.com/zatca_sa","linkLabel":"Twitter / X"}],"team":["Eng. Abdullah Alfuntukh, Strategy and Development Vice Governor","Eng. Mazen Akdar, Strategy Planning and PMO General Manager ","Eng. Maher Aljohani, Project Management Operations Director","Eng. Fahad Alshathly, Ports and Facilities Portfolio Management Director","Eng. Abraheam Alojairi, Digital Transformation Portfolio Management Director","Eng. Mohammed Almuhanna, Strategic Pillars Portfolio Management Director","Mr. Meshal Alkelaiwi, Business Facilitation Portfolio Management Director"],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"The Saudi ZATCA Project Management Office","subtitle":"The Saudi Zakat, Tax and Customs Authority (ZATCA)","leadVideo":null,"leadImage":null,"description":["The PMO plays a major role in ensuring ZATCA’s success through effective project management. They serve as a centralized hub for project oversight and governance. In addition, they established and standardized processes, methodologies, and best practices across all ZATCA Sector and Deputyships ensuring that projects align with strategic goals and remain on track. Also, they facilitate resource allocation, helping to optimize workforce utilization across various projects.","Moreover, they provide invaluable decision support through data analytics and reporting, offering stakeholders insights into project performance and potential risks. which fosters collaboration and knowledge sharing among project managers and teams, promoting continuous improvement. Those at ZATCA EPMO act as change agents, driving organizational transformation by instilling a project-oriented culture and ensuring alignment with evolving business objectives.","In summary, they are the cornerstone of effective project management at ZATCA’s level, offering structure, governance, and strategic alignment, ultimately leading to increased project success rates, and enhanced overall business performance."],"images":[{"imageFilename":"ex10_img1_landport.jpg","imageCaption":"Building the first land port between KSA and Oman: Empty Quarter Land Port. The urgent project and operation was completed in 60 days."},{"imageFilename":"ex10_img2_worldcup.jpg","imageCaption":"Building The World Cup 2023 Salwa Land Port. The project aimed to increase the capacity and complete rehabilitation of the land port with Qatar, to facilitate the journey of passengers for the World Cup."},{"imageFilename":"ex10_img3_logisticszone.jpg","imageCaption":"Integrated Special Logistics Zone. The project aims to establish a special logistical zone that attracts quality investments, to be practiced in it after obtaining the necessary licenses and approvals from the authority."}],"creditGrid":[]}