{"id":"24","awardCategory":"Academic Awards","titleBarTitle":"Donald S. Barrie Award","awardStatus":"Winner","sidebarTitle":"Donald S. Barrie Award","sidebarCategory":"","aboutText":"The Donald S. Barrie Award is for a paper which advances the PMBOK ® Guide in the field of design, procurement and/or construction by providing a useful contribution to the engineering and construction industry. In general, the paper should present a pragmatic approach to engineering and construction issues. The award is sponsored by the former PMI Design-Procurement-Construction Specific Interest Group (DPC SIG). ","links":[{"linkUrl":"https://faculty.engineering.asu.edu/asmar/person/hala-sanboskani/ ","linkLabel":"Profile"},{"linkUrl":"https://www.linkedin.com/in/hala-sanboskani-a182ab13b/ ","linkLabel":"LinkedIn"},{"linkUrl":"https://scholar.google.com/citations?user=4zPK9vgAAAAJ&hl=en ","linkLabel":"Google Scholar"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Hala Sanboskani","subtitle":"Arizona State University","leadVideo":"","leadImage":"ex24_hero.png","description":["With 19 years of distinguished leadership in IT strategy and global digital transformation, Mohd Fakhri Bin Mohd Noor has been at the forefront of driving innovative changes across organizations. Renowned for his strategic acumen, Noor excels in program and project management, stakeholder engagement, and risk mitigation. As a dedicated leader, he emphasizes team mentorship, ensuring optimal performance delivery. In his current role as Farmbyte's Head of Digital (CDO), he steers the development and launch of digital products that anchor the company's future revenue streams.","His prior achievements include leading a myriad of digital projects such as the Petronas Loyalty Cardless Earning & Redemption initiative and implementing modernized payment solutions. His passion for digital evolution is unwavering, and he continually aspires to harness his expertise for significant industry impact."],"images":[{"imageFilename":"ex24_img1_poster.png","imageCaption":"Participant at student research competition, presenting her work on qualifications-driven procurement for contractors in trenchless construction in the U.S. And attendee at conference of NASTT 2023 No-dig show, Portland, OR."},{"imageFilename":"ex24_img2_onstage.png","imageCaption":"Participant at Engineering News-Record first in-person Top Young Professionals Conference, February 23-25, 2022, Tempe, AZ. Hala volunteered for an on-the-spot showcase regarding planning and teamwork."},{"imageFilename":"ex24_img3_crc.png","imageCaption":"Hala presenting one of her 3 accepted papers, on qualifications-driven processes and criteria to select construction manager at risk contractor in U.S. public projects, at ASCE-CI & CRC Joint Conference 2022, Virginia Tech, D.C."},{"imageFilename":"ex24_img4_lebanon.png","imageCaption":"Hala presenting her accepted paper on factors affecting knowledge sharing among construction workers at ASCE-CRC 2020 Conference, ASU, Tempe, AZ. The paper was ranked top 10% of accepted CRC papers (in-person ASU 2020)."},{"imageFilename":"ex24_img5_team.png","imageCaption":"Women in control photo at AACE International Conference and Expo 2023, Chicago, IL."}],"creditGrid":[]}