{"id":"11","awardCategory":"People Awards","titleBarTitle":"PMI Fellow Award","awardStatus":"Recipient","sidebarTitle":"","sidebarCategory":"PMI Fellow Award","aboutText":"The PMI Fellow Award is the highest and most prestigious individual award presented by Project Management Institute for service to the Institute and the project management profession.","links":[{"linkUrl":"https://pmi-france.org/","linkLabel":"PMI France Website"},{"linkUrl":"https://www.linkedin.com/in/jean-claude-dravet-0913b31/","linkLabel":"LinkedIn"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Jean-Claude Dravet","subtitle":"","leadVideo":null,"leadImage":"ex11_hero.jpg","description":["Jean-Claude Dravet is a distinguished project management professional with a 32-year career at IBM, culminating in the role of Executive Portfolio Manager. He has held PMI membership for 25 years and is a certified PMP. Jean-Claude has been dedicated to training professionals and students for 17 years. He was also instrumental in founding two PMI chapters and served as Chapter President and Honorary President.","Within PMI, he acted as a local sponsor for two PMI EMEA Congresses, contributed as an EMEA Regional Mentor, and propelled PMI France Chapter to rank among the top five worldwide. Jean-Claude is committed to knowledge sharing, participating in over 10 PMI LIMs and serving on several PMI Global committees. He initiated an annual Project Management Job Fair connecting emerging talent with companies. He's a published author in PMI publications, an event organizer, and a co-author of a book on Transformational Leadership."],"images":[{"imageFilename":"ex11_img1_pmifrancesud.jpg","imageCaption":"PMI France-Sud founding members - Kick-off meeting - Networking lunch and Membership growth tracking."},{"imageFilename":"ex11_img2_pmifrancesudcongress.jpg","imageCaption":"PMI France-Sud and PMI France sponsored Congress."},{"imageFilename":"ex11_img3_awards.jpg","imageCaption":"PMI Awards Jean-Claude has received."},{"imageFilename":"ex11_img4_award.jpg","imageCaption":"PMI France \"Jean-Claude Dravet Award\" for NextGen contributors"},{"imageFilename":"ex11_img5_jobfair.jpg","imageCaption":"PMPD (Project Management Professional Days) Virtual Job Fair"}],"creditGrid":[]}