{"id":"25","awardCategory":"Academic Awards","titleBarTitle":"PMI Young Researcher Award","awardStatus":"Winner","sidebarTitle":"PMI Young Researcher Award","sidebarCategory":"","aboutText":"The PMI Young Researcher Award recognizes and celebrates emerging leaders in the academic field of project, program, and/or portfolio management with potential achievements to make a significant impact on the field and practice.","links":[{"linkUrl":"https://www.linkedin.com/in/juliano-denicol/ ","linkLabel":"LinkedIn"},{"linkUrl":"https://twitter.com/Juliano_Denicol","linkLabel":"Twitter / X"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Dr. Juliano Denicol","subtitle":"University College London","leadVideo":"","leadImage":"ex25_hero.jpg","description":["Dr. Juliano Denicol is the Director of the Megaproject Delivery Centre at University College London (UCL) and the founding Programme Director of the MBA Major Infrastructure Delivery. Before joining UCL, Dr. Denicol has worked as a supply chain management consultant at High Speed 2, the largest infrastructure project in Europe, and advisor to the European Commission on public procurement policies. ","Dr. Denicol’s research explores the management of megaprojects, emphasizing the design of client organizations and strategies to engage, procure and coordinate the supply chain. His work on megaprojects has been regarded for his global impact, receiving multiple research awards. Research areas include: Programme Management, Procurement and Supply chain management, Organisation Design, and Governance structures. ","His previous research included several iconic megaprojects in the UK: High Speed 1, Heathrow Airport Terminal 5, London 2012 Olympics, Crossrail, Thames Tideway Tunnel, and High Speed 2. He was Co-Investigator of Project X, a major research network to improve major project delivery in the UK, established by nine universities in collaboration with the Infrastructure and Projects Authority (IPA), and the Cabinet Office."],"images":[{"imageFilename":"ex25_img1_mba.png","imageCaption":"Launching the MBA Major Infrastructure Delivery at University College London. Founding Programme Director."},{"imageFilename":"ex25_img2_award.jpg","imageCaption":"Receiving the 2023 PMI Young Researcher Award in Dublin, Ireland (June 2023)."},{"imageFilename":"ex25_img3_paper.png","imageCaption":"2022 Project Management Research Paper of the Year Award, Association for Project Management (APM). 2021 Most Cited Paper of the Year Award, and 2021 Most Downloaded Paper Award from the Project Management Journal (PMJ)."}],"creditGrid":[]}