{"id":"4","awardCategory":"Project Awards","titleBarTitle":"PMI Project of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI Project of the Year Award","aboutText":"The PMI Project of the Year Award, PMI Large and Mega Project Award, and PMI Small and Mid-Size Project Award recognize complex projects that best deliver superior performance of project management practices, expert organizational results, and positive impacts on society.","links":[{"linkUrl":"https://www.bge.com/SmartEnergy/InnovationTechnology/Pages/Key-Crossing-Initiative.aspx","linkLabel":"Website"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Key Crossing Reliability Initiative","subtitle":"Program Manager: Burns & McDonnell, Project Owner/Developer: Baltimore Gas & Electric, General Contractor/Construction Manager: McLean Contracting Company, Lead Design Firm: Sargent & Lundy, Structural Engineer: Valmont, Civil Engineer: Moffatt & Nichol, Permitting Consultant: Century Engineering","leadVideo":"4_finalist.mp4","leadImage":null,"description":["The purpose of the Key Crossing Reliability Initiative was to replace 2.25 miles of aging underground transmission lines below the Patapsco River in Baltimore, Maryland, with a new and more reliable overhead solution. A new double circuit 230kV line segment was installed across Baltimore Harbor's active shipping channel and is supported by some of the tallest transmission monopoles in North America. Due to the significance of the location of the electric infrastructure, Baltimore Gas and Electric launched this project to preserve the integrity of the transmission system and to ensure safe and reliable power delivery to its customers. Customers in the BGE service territory benefit from a more modern infrastructure that provides reliable power delivery across the state of Maryland while minimizing environmental impacts on the critical Chesapeake Bay area."],"images":[{"imageFilename":"ex4_img8_topdown.jpg","imageCaption":"Barge-mounted cranes installing piles and precast concrete sections for the Vessel Collision Protection structures."},{"imageFilename":"ex4_img7_water.jpg","imageCaption":"Construction team preparing foundation piles for final cut-off at the Vessel Collision Protection structures"},{"imageFilename":"ex4_img6_workers.jpg","imageCaption":"Project Managers and engineers discussing project details at a tower foundation location"},{"imageFilename":"ex4_img4_helicopter.png","imageCaption":"Helicopter stringing operations."},{"imageFilename":"ex4_img5_collision.png","imageCaption":"Vessel collision protection construction."},{"imageFilename":"ex4_img1_installing.jpg","imageCaption":"Installing foundation pipe piles in the river."},{"imageFilename":"ex4_img2_precast.jpg","imageCaption":"Setting precast concrete on the foundation piles."},{"imageFilename":"ex4_img3_steelpole.jpg","imageCaption":"Erecting a steel pole."}],"creditGrid":[]}