{"id":"23","awardCategory":"Academic Awards","titleBarTitle":"PMIEF James R. Snyder Award","awardStatus":"Winner","sidebarTitle":"James R. Snyder International Student Paper of the Year Award","sidebarCategory":"","aboutText":"This research paper award recognizes excellence in student development of original concepts in project management. Papers are selected based upon the research and creative effort that are best directed toward advancing the concepts, tools and techniques of managing project-oriented tasks.","links":[{"linkUrl":"https://www.linkedin.com/in/mohdfakhri/","linkLabel":"LinkedIn"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Mohd Fakhri Bin Mohd Noor","subtitle":"Farmbyte Pvt. Ltd.","leadVideo":"","leadImage":"ex23_hero.jpg","description":["With 19 years of distinguished leadership in IT strategy and global digital transformation, Mohd Fakhri Bin Mohd Noor has been at the forefront of driving innovative changes across organizations. Renowned for his strategic acumen, Noor excels in program and project management, stakeholder engagement, and risk mitigation. As a dedicated leader, he emphasizes team mentorship, ensuring optimal performance delivery. In his current role as Farmbyte's Head of Digital (CDO), he steers the development and launch of digital products that anchor the company's future revenue streams.","His prior achievements include leading a myriad of digital projects such as the Petronas Loyalty Cardless Earning & Redemption initiative and implementing modernized payment solutions. His passion for digital evolution is unwavering, and he continually aspires to harness his expertise for significant industry impact."],"images":[{"imageFilename":"ex23_img1_graduation.jpg","imageCaption":"Mohd graduated from Heriot-Watt University in Strategic Project Management and received the James R. Snyder International Student Paper of the Year Award for his final dissertation. "},{"imageFilename":"ex23_img2_malaysia.jpg","imageCaption":"Mohd alongside Malaysia's Minister of Finance and the Petronas Dagangan Berhad management team during the launch of the e-wallet testing for the government's e-subsidy program."},{"imageFilename":"ex23_img3_agriculture.jpg","imageCaption":"Mohd is venturing into vast agricultural terrains. His primary objective is to fortify the local farming community by integrating digital solutions, thereby refining the agro-food value chain. Through meticulous project management practices, he is committed to driving transformative changes for the betterment and sustainable growth of the agricultural sector."},{"imageFilename":"ex23_img4_petronas.jpg","imageCaption":"The resilient team from Petronas, reflecting on the myriad of projects they have navigated together. The journey, replete with its highs and lows, underscored the quintessential value of teamwork in project management. Success is not just about individual prowess but harnessing the collective strength and dedication of every team member. A testament to the tenets Mohd has upheld over the years in the realm of project management."}],"creditGrid":[]}