{"id":"22","awardCategory":"PMIEF Awards","titleBarTitle":"Kerzner Award for PM Excellence","awardStatus":"Winner","sidebarTitle":"Kerzner Award for Excellence in Project Management","sidebarCategory":"","aboutText":"The purpose of The Kerzner Award is to recognize a project manager who has exemplified superior performance and outstanding project management methods, skills, and techniques, and their important contributions in business, industry, government, community or not-for-profit environments. The award, sponsored by International Institute for Learning, Inc., is named in recognition of Dr. Harold Kerzner, Executive Director for Project Management, IIL. He is a globally recognized expert on project, program, portfolio management, and strategic planning and is the author of more than 60 best-selling books about project management.","links":[{"linkUrl":"linkedin.com/in/laura-jones-383a1147","linkLabel":"LinkedIn"},{"linkUrl":"https://www.pmi.org/future-50/2020-honorees/laura-jones","linkLabel":"Future 50"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Laura Jones","subtitle":"Special Olympics International","leadVideo":"","leadImage":"ex22_hero.jpg","description":["Laura Jones is the Senior Director of Strategic Operations and PMO at Special Olympics International. With a career spanning over a decade, Laura has excelled in identifying opportunities for process improvement and developing practical solutions to achieve strategic goals. Her core focus is on operational efficiency and the continuous drive for streamlined operations.","Laura's career initially centered on healthcare, where she managed various facets, including financial, technological, research analytics, and operational processes. Her notable contributions include pioneering the integration of Google Glass in healthcare clinics and spearheading the implementation of clinical trials for cancer research.","Operating at a global level, Laura collaborates with diverse teams, fostering cultures of innovation and accountability through project management methodologies. She empowers leaders and stakeholders to monitor projects, driving tangible results that ultimately benefit Special Olympic athletes. Laura's expertise lies in her ability to navigate complex environments and deliver impactful solutions that enhance organizational excellence."],"images":[{"imageFilename":"ex22_img1_berlin.jpg","imageCaption":"World Games Berlin 2023: Global Athlete Congress"},{"imageFilename":"ex22_img2_training.jpg","imageCaption":"World Games Berlin 2023: Global Athlete Congress PM Training"}],"creditGrid":[]}