{"id":"15","awardCategory":"People Awards","titleBarTitle":"PMI Eric Jenett Person of the Year Award","awardStatus":"Winner","sidebarTitle":"PMI Eric Jenett Person of the Year Award ","sidebarCategory":"","aboutText":"The PMI Eric Jenett Person of the Year Award (formerly the PMI Eric Jenett Project Management Excellence Award) recognizes and honors an individual who has made an outstanding contributions to the project management profession or its practice through leadership, technical project management, and strategic and business management acumen.","links":[{"linkUrl":"https://www.linkedin.com/in/mhaerri/","linkLabel":"LinkedIn"},{"linkUrl":"https://pmi-switzerland.ch/index.php/membership/corporate-networking-group","linkLabel":"Swiss Corporate Networking Group"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Martin Härri","subtitle":"SIX Group","leadVideo":null,"leadImage":"ex15_hero.jpg","description":["Martin started his career at a global consulting company, where he learned the basics of successful software projects. In his next job, he worked on a project which did not go well. He realized that it must be this thing called “project management” which made the difference, so he eventually went to a multinational IT corporation where he read every documentation and took every training that was available on the topic. Since then, he has been hooked on project management. Martin has over 30 years of experience in various consulting and financial services companies, mostly leading project offices.","He is also a founding member of the PMI Switzerland Chapter, and in the last 22 years was a board member and chapter president, and has held various volunteer positions, most notably director corporate relationships, managing the PMI Swiss Corporate Networking Group (SCNG)."],"images":[{"imageFilename":"ex15_img1_scng.jpg","imageCaption":"Kickoff of the PMI SCNG in January 2010 (3 of the original founders are still active)."},{"imageFilename":"ex15_img2_scngmeeting.jpg","imageCaption":"PMI SCNG meeting in February 2020 with Sunil Prashara (PMI president) and Ricardo Viana Vargas (Executive Director Brightline)."},{"imageFilename":"ex15_img3_volunteer.jpg","imageCaption":"PMI Switzerland Chapter Annual Members Meeting February 2020, with some members of the conference team, receiving the volunteers of the year award from chapter president Irina Petkova."},{"imageFilename":"ex15_img4_ruag.jpg","imageCaption":"PMI SCNG meeting January 2023 with the participants, and the CEO of RUAG (Swiss defense company)."},{"imageFilename":"ex15_img5_chapter.jpg","imageCaption":"Moderating the strategy meeting of the board of the PMI Switzerland Chapter."}],"creditGrid":[]}