{"id":"13","awardCategory":"People Awards","titleBarTitle":"PMI Fellow Award","awardStatus":"Recipient","sidebarTitle":"","sidebarCategory":"PMI Fellow Award","aboutText":"The PMI Fellow Award is the highest and most prestigious individual award presented by Project Management Institute for service to the Institute and the project management profession.","links":[],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Deanna Landers, PMP","subtitle":"Project Managers Without Borders","leadVideo":null,"leadImage":"ex13_hero.jpg","description":["Deanna Landers, an innovator in project management with over 30 years of experience, has made a significant impact. She's more than a project manager; she's dedicated to helping people develop essential life skills through project management.","During her tenure on the PMI board from 2021 to 2014, Deanna played crucial roles in shaping the direction of project management. Beyond that, she established \"Project Managers without Borders,\" a nonprofit empowering other nonprofit organizations to improve their work through project management.","In Denver, Colorado, Deanna served as the Board Chair of the PMI Mile High Chapter, leaving a lasting mark on her local community. She shared her expertise, providing guidance at Georgetown University and the University of Denver on project management programs. Furthermore, she is a sought-after speaker at conferences and universities.","Deanna served as the Director of Program Management at Charter Communications in her career, ensuring excellence in managing projects, programs, and portfolios. Prior to that role, she spent 11 years at IBM, contributing to their journey toward project management excellence and delivering substantial projects valued at $350 million."],"images":[{"imageFilename":"ex13_img1_pmwithoutborders.jpg","imageCaption":"Project Managers Without Borders Board of Directors 2017."},{"imageFilename":"ex13_img2_ibmtokyo.jpg","imageCaption":"IBM Tokyo speaking engagement in 2016."},{"imageFilename":"ex13_img3_jimsnyder.jpg","imageCaption":"Deanna with PMI Founder Jim Snyder in San Diego, 2016."},{"imageFilename":"ex13_img4_boardvolunteer.jpg","imageCaption":"Board Volunteer Advisory Committee 2017."},{"imageFilename":"ex13_img5_dubai.jpg","imageCaption":"Dubai board strategic retreat in 2014."}],"creditGrid":[]}