{"id":"19","awardCategory":"Chapter Awards","titleBarTitle":"Category III: 1501 or More Members","awardStatus":"","sidebarTitle":"Chapter of the Year Award","sidebarCategory":"Category III: 1501 or More Members","aboutText":"The PMI Chapter Awards program provides recognition of volunteer efforts, motivates chapter leaders, and acknowledges their contributions toward achieving PMI's goals.","links":[{"linkUrl":"https://pmiphx.org/","linkLabel":"PMI Phoenix Chapter"},{"linkUrl":"https://pmisp.org.br/","linkLabel":"PMI São Paulo, Brazil Chapter"},{"linkUrl":"https://www.pmi.org/chapters/northern-italy","linkLabel":"PMI Northern Italy Chapter"},{"linkUrl":"https://www.pmimumbaichapter.org/","linkLabel":"PMI Mumbai Chapter"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Winner: PMI Phoenix Chapter","subtitle":"North America Region","leadVideo":"","leadImage":"ex19_hero_phoenix.jpg","description":["Pictured above: By the end of 2022, the Phoenix Chapter had three on-site and two virtual social good campaigns. These initiatives involved 18 volunteers who generated excitement for other people to become involved via donations and had significant impacts on individuals in their community and beyond, resulting in $1200 in donations collected for the Support Ukraine effort through a web-based partnership with the American Red Cross. 272 family beneficiaries of Mom’s Pantry received food from their on-site project to pack food boxes. $1148 was raised along with donated outerwear that benefited 1280 individuals because of their coordinated effort with One Warm Coat.","They designated volunteer “Valley Champions” who picked up coats and other outerwear from central locations while other volunteers met on-site at the donation location to count coats and outerwear. $780 was raised with 26 beneficiaries of Mom’s Pantry receiving food from our collaborative Pack the Pantry Virtual Food Drive and $3350 was raised for St Mary’s Food Bank."],"images":[{"imageFilename":"ex19_img1_sao-paulo.jpg","captionTitle":"Finalist: PMI São Paulo, Brazil Chapter | Latin America Region","imageCaption":"Pictured above: The Board of PMI São Paulo, Brazil Chapter - 228 Happy Hour - Celebrating 25 years of the Chapter of São Paulo."},{"imageFilename":"ex19_img2_northern-italy.jpg","captionTitle":"Finalist: PMI Northern Italy Chapter | Europe Region","imageCaption":"With a motto of \"Passion & Professionalism,\" PMI Northern Italy Chapter aims higher—literally!"},{"imageFilename":"ex19_img3_mumbai.jpg","captionTitle":"Finalist: PMI Mumbai Chapter | South Asia Region","imageCaption":"Pictured above: PMI Mumbai Chapter AGM 2023."}],"creditGrid":[]}