{"id":"24","awardCategory":"Academic Awards","titleBarTitle":"Donald S. Barrie Award","awardStatus":"Winner","sidebarTitle":"Donald S. Barrie Award","sidebarCategory":"","aboutText":"The Donald S. Barrie Award is for a paper which advances the PMBOK ® Guide in the field of design, procurement and/or construction by providing a useful contribution to the engineering and construction industry. In general, the paper should present a pragmatic approach to engineering and construction issues. The award is sponsored by the former PMI Design-Procurement-Construction Specific Interest Group (DPC SIG). ","links":[{"linkUrl":"https://faculty.engineering.asu.edu/asmar/person/hala-sanboskani/ ","linkLabel":"Profile"},{"linkUrl":"https://www.linkedin.com/in/hala-sanboskani-a182ab13b/ ","linkLabel":"LinkedIn"},{"linkUrl":"https://scholar.google.com/citations?user=4zPK9vgAAAAJ&hl=en ","linkLabel":"Google Scholar"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Hala Sanboskani","subtitle":"Arizona State University","leadVideo":"","leadImage":"ex24_hero.png","description":["Hala Sanboskani is a Ph.D. candidate in civil, sustainable, and environmental engineering specializing in construction engineering and management. She received her bachelor’s degree in civil engineering, and her M.E. in construction and project management from the American University of Beirut.","Hala’s research focuses on integrated project management and delivery. More particularly, how to implement innovative methods and tools to efficiently implement integrated management and integrated delivery in large government-owned projects. She uses statistical analyses to recommend team management approaches. Hala also works on using innovative project delivery methods and project management systems to develop decision-making frameworks. Nevertheless, she works on projects encouraging the sustainability approach.","Hala has taught civil engineering and construction management courses. She is passionate about volunteering and mentoring enthusiastic generations. She loves adventures in nature, outdoor play, and performs the Lebanese Dabke."],"images":[{"imageFilename":"ex24_img1_poster.png","imageCaption":"Participant at student research competition, presenting her work on qualifications-driven procurement for contractors in trenchless construction in the U.S. And attendee at conference of NASTT 2023 No-dig show, Portland, OR."},{"imageFilename":"ex24_img2_onstage.png","imageCaption":"Participant at Engineering News-Record first in-person Top Young Professionals Conference, February 23-25, 2022, Tempe, AZ. Hala volunteered for an on-the-spot showcase regarding planning and teamwork."},{"imageFilename":"ex24_img3_crc.png","imageCaption":"Hala presenting one of her 3 accepted papers, on qualifications-driven processes and criteria to select construction manager at risk contractor in U.S. public projects, at ASCE-CI & CRC Joint Conference 2022, Virginia Tech, D.C."},{"imageFilename":"ex24_img4_lebanon.png","imageCaption":"Hala presenting her accepted paper on factors affecting knowledge sharing among construction workers at ASCE-CRC 2020 Conference, ASU, Tempe, AZ. The paper was ranked top 10% of accepted CRC papers (in-person ASU 2020)."},{"imageFilename":"ex24_img5_team.png","imageCaption":"Women in control photo at AACE International Conference and Expo 2023, Chicago, IL."}],"creditGrid":[]}