{"id":"26","awardCategory":"Academic Awards","titleBarTitle":"PMI Linn Stuckenbruck Teaching Excellence Award","awardStatus":"Winner","sidebarTitle":"PMI Linn Stuckenbruck Teaching Excellence Award","sidebarCategory":"","aboutText":"The PMI Linn Stuckenbruck Teaching Excellence Award recognizes and honors an individual faculty member for excellence in teaching project management, and for their strong commitment to improving and enhancing project management curricula in higher education.","links":[{"linkUrl":"https://www.linkedin.com/in/jmwoods/ ","linkLabel":"LinkedIn"},{"linkUrl":"https://linktr.ee/jmwoods ","linkLabel":"Linktree"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Juanita Woods, Ph.D., PMP, PgMP","subtitle":"University of North Georgia","leadVideo":"","leadImage":"ex26_hero.jpg","description":["Juanita M. Woods, Ph.D., PMP, PgMP, is an Associate Professor with the Mike Cottrell College of Business at the University of North Georgia. Dr. Woods has over 25 years of experience managing projects and people and ensuring projects align with organizational and group objectives. Her current research areas bridge the disciplines of project studies, people development, and work teams. ","In her work in the private sector as a project and program manager and the public sector as a college professor, Dr. Woods mentors people at all career stages in strengthening their leadership skills, business acumen, and technical skills in project management. As a college professor of project management, Dr. Woods feels it is her responsibility to support the professional development of today’s workforce and the next generation of workers. She conducts academic and practitioner research in teamwork and leadership, project studies, knowledge management, and teaching and learning scholarship to provide opportunities for learning and professional development to aspiring, new, and current project management practitioners."],"images":[{"imageFilename":"ex26_img1_officers.jpg","imageCaption":"Officers and Business Advisory Board Members of the UNG Enactus and Project Management Clubs (Spring 2023)."},{"imageFilename":"ex26_img2_presentation.png","imageCaption":"Juanita Woods presenting at a PMI Atlanta Chapter professional development event (Fall 2023)."},{"imageFilename":"ex26_img3_speakers.jpg","imageCaption":"Guest Speakers with PM Club Officers at the Spring 2023 Professional Development Event (UNG)."},{"imageFilename":"ex26_img4_teaching.jpg","imageCaption":"Juanita Woods teaching UNG MCCB students (Fall 2023)."},{"imageFilename":"ex26_img5_teamtextbook.jpg","imageCaption":"The team that worked with Juanita to help make the PM textbook a reality (Fall 2022)."}],"creditGrid":[]}