{"id":"3","awardCategory":"Project Awards","titleBarTitle":"PMI Project of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI Project of the Year Award","aboutText":"The PMI Project of the Year Award, PMI Large and Mega Project Award, and PMI Small and Mid-Size Project Award recognize complex projects that best deliver superior performance of project management practices, expert organizational results, and positive impacts on society.","links":[],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Reopening the Coquihalla after the 2021 Atmospheric River Event","subtitle":"British Columbia Ministry of Transportation and Infrastructure, Yellowhead Road & Bridge (Nicola) Ltd., Emil Anderson Maintenance Co. Ltd., Nlaka'pamux Nation Tribal Council (NNTC), Sto:lo Nation, Okanagan Nation","leadVideo":null,"leadImage":null,"description":["In November 2021, record-breaking rainfall led to catastrophic flooding throughout British Columbia, Canada. The unique weather event – labeled an atmospheric river –triggered widespread flooding, fatal mudslides, and collapsed major highways, roads and bridges. The resulting damage to highway infrastructure forced every major connection between the Greater Vancouver area, the Interior of BC, and Canada to close, including Highway 5 (‘The Coquihalla’). Gas was rationed and food supply was limited. In five weeks, more than 300 workers using over 200 pieces of equipment moved more than 400,000 cubic meters (523,000 cubic yards) of gravel and rock and repaired 27 damaged sites, including 15 washouts, 7 bridge structures, and 5 debris flows to reopen the Coquihalla to commercial vehicle traffic on December 20, 2021, just 35 days after the catastrophic event. The project team continued to work 24 hours a day until the highway opened to all traffic on January 19, 2022."],"images":[{"imageFilename":"Collapsed Culvert (1).jpeg","imageCaption":"Assessing the damage from a collapsed culvert immediately after the event."},{"imageFilename":"Collapsed Bridge Span (1).jpeg","imageCaption":"Collapsed bridge span being inspected by MOTI engineers."},{"imageFilename":"Preparation Work for Bridge Span (1).jpeg","imageCaption":"Preparation work underway to install temporary bridge span."},{"imageFilename":"Winter Paving (1).jpeg","imageCaption":"December construction on the high mountain pass required paving in winter conditions."},{"imageFilename":"Team Photo (1).jpeg","imageCaption":"Workers on the new bridge deck with Minister of Transportation and Infrastructure, Rob Fleming (center, blue shirt)."}],"creditGrid":[{"creditName":"Vittal Anaantatmula, DSc, PMP","creditDescription":"Professor, Western Carolina University","creditLocation":"Cullowhee, North Carolina, USA"},{"creditName":"Frank Anbari, PhD, PMP","creditDescription":"Professor Emeritus, Drexel University","creditLocation":"Philadelphia, Pennsylvania, USA"}]}