{"id":"5","awardCategory":"Project Awards","titleBarTitle":"PMI Project of the Year Award","awardStatus":"Finalist","sidebarTitle":"","sidebarCategory":"PMI Project of the Year Award","aboutText":"The PMI Project of the Year Award, PMI Large and Mega Project Award, and PMI Small and Mid-Size Project Award recognize complex projects that best deliver superior performance of project management practices, expert organizational results, and positive impacts on society.","links":[{"linkUrl":"https://alluvionic.com/","linkLabel":"Website"},{"linkUrl":"https://www.linkedin.com/company/alluvionic-inc-/","linkLabel":"LinkedIn"},{"linkUrl":"https://www.facebook.com/Alluvionic","linkLabel":"Facebook"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Space Force Rocket Launch Checklist Modernization","subtitle":"Alluvionic, United States Space Force","leadVideo":"5_finalist.mp4","leadImage":null,"description":["In 2021, Alluvionic won a Patrick Space Force Base Pitch Day Competition for a contract to modernize 14 rocket launch checklists for the First Range Operations Squadron and the 45th Weather Squadron. Over the course of roughly two months, the project team moved checklists from Excel and One Note into Smartsheet. These are the checklists that are executed in the weeks, days, hours, and seconds prior to the launch of a rocket at Patrick SFB and the Eastern Range. These Smartsheet Checklists connect to a visual dashboard, so that the senior leader tasked with Launch Decision Authority has a decision quality dashboard to make the critical “GO, NO/GO” call just prior to the launch of the rocket. The September 16, 2021 launch of the SpaceX Inspiration4 mission was the first launch of a fully commercial, non-governmental crew. It was also the first mission to be executed with Alluvionic’s upgraded checklists, which are still in use today. ","SpaceX Inspiration4 marks a historic milestone as the first launch to leverage Alluvionic’s Eastern Range Rocket Launch Smartsheet Checklist Modernization Project. This cutting-edge initiative streamlines launch procedures, while enhancing efficiency and safety. It showcases a commitment to innovation and revolutionizing the future of space exploration."],"images":[{"imageFilename":"ex5_img1_newlaunchstandard.png","imageCaption":"Setting a New Launch Standard: The Inspiration4 rocket takes flight, marking the inaugural use of Alluvionic's Space Force Rocket Launch Checklist Modernization."},{"imageFilename":"ex5_img2_employeeview.jpg","imageCaption":"An Employee's View: Witnessing history as the first rocket guided by Alluvionic's innovative checklists soars, marking a leap forward in efficiency and safety for space exploration in collaboration with the US Space Force and NASA."},{"imageFilename":"ex5_img3_milestone.png","imageCaption":"Capturing a Milestone Moment: An employee's exhilarating view across the river captures the inaugural mission utilizing Alluvionic's checklists, a testament to enhanced efficiency and safety in space exploration achieved through collaboration with US Space Force and NASA."},{"imageFilename":"ex5_img4_falcon.jpg","imageCaption":"Inaugurating a New Era: The Inspiration4 rocket's awe-inspiring takeoff from its launch pad, powered by Alluvionic's groundbreaking checklists, heralding enhanced efficiency and safety in space exploration alongside partners US Space Force and NASA."},{"imageFilename":"ex5_img5_launchcontrol.jpg","imageCaption":"Elevating Launch Preparedness: Inside NASA's Launch Control Center, Alluvionic's Smartsheet checklists and visual dashboards stand ready to enhance efficiency and safety, a testament to pioneering collaboration with US Space Force that advances space exploration."}],"creditGrid":[]}