{"id":"9","awardCategory":"PMO Awards","titleBarTitle":"PMI PMO of the Year Award","awardStatus":"Winner","sidebarTitle":"","sidebarCategory":"PMI PMO of the Year Award","aboutText":"The PMI PMO of the Year Award honors a PMO that has demonstrated superior organizational project management abilities by adding value to its organization through its support of successful strategic initiatives. The award recognizes a PMO that has established a vision for value delivery and has had a positive and clear impact on business results. ","links":[{"linkUrl":"https://www.mayoclinic.org/","linkLabel":"Website"},{"linkUrl":"https://www.linkedin.com/showcase/management-engineering-and-consulting-/","linkLabel":"LinkedIn"}],"team":["Jon Blixt, Director","Mindy Boynton, Manager","Sarah Dhanorker, Manager","Mark Hayes, Manager","Michael Klein, Division Chair","Heather McFarland, Senior Agile Coach","Christine Shakal, Manager","Joe Woodie, Senior Strategist"],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Mayo Clinic Enterprise Portfolio Management Office","subtitle":"Mayo Clinic","leadVideo":null,"leadImage":null,"description":["EPMO is Mayo Clinic’s enterprise project execution arm to advance its long-term strategic priorities. They serve as the enterprise change nexus, addressing project, program, and portfolio management (including business analysis) needs around the institution. All three of the component groups learn from and help to instruct each other – they perform best when they share and receive information freely.","The EPMO Resource Team consists of Project/Program Managers and Business Analysts who drive significant project efforts throughout the enterprise. The Enterprise Project and Portfolio Management (EPPM) team provides portfolio/project support, data analytics and reporting, enables standardization, and facilitates capacity management through the Mayo Clinic enterprise PPM solution. Finally, the Enterprise Agile Transformation Office (eATO) facilitates change from more traditional waterfall approaches to hybrid and Agile, where appropriate."],"images":[{"imageFilename":"ex9_img1_mayoepmo.jpg","imageCaption":"Mayo EPMO team participating in a hybrid in-person and virtual retreat."},{"imageFilename":"ex9_img2_bold.jpg","imageCaption":"Mayo Bold. Forward. Unbound. in Rochester campus expansion plan."},{"imageFilename":"ex9_img3_strategydept.png","imageCaption":"Mayo Clinic's Strategy department, the parent department of Mayo's EPMO, at an offsite retreat."},{"imageFilename":"ex9_img4_groundbreaking.jpg","imageCaption":"Project team breaking ground on a $200M expansion of proton beam treatment capability in Rochester, MN."}],"creditGrid":[]}