{"id":"16","awardCategory":"People Awards","titleBarTitle":"PMI Rising Leader Award","awardStatus":"Winner","sidebarTitle":"PMI Rising Leader Award","sidebarCategory":"","aboutText":"The PMI Rising Leader Award (formerly PMI Young Professional Award) recognizes and honors a young professional who has made a significant impact in advancing project management within an organization, advancing the knowledge and understanding of the practice of project management, and demonstrating an understanding of PMI standards, practices and ethics.","links":[{"linkUrl":"https://www.linkedin.com/in/maljohani/","linkLabel":"LinkedIn"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Maher Aljohani","subtitle":"The Saudi Zakat, Tax and Customs Authority (ZATCA)","leadVideo":null,"leadImage":"ex16_hero.jpg","description":["Maher Aljohani has extensive experience leading and working on numerous large-scale projects for both government entities and the private sector. He has had the honor of representing the Kingdom of Saudi Arabia on various occasions. In his role, he has been responsible for project management, negotiating with end-users and stakeholders, and providing valuable advice and guidance.","Furthermore, he played a crucial role in establishing a Project Management Office (PMO) and implementing best practices to ensure effective project management governance and methodology. To promote these practices, his team conducted multiple awareness sessions and created a comprehensive booklet outlining their approved project management practices. They have also actively benchmarked their practices against other local and global authorities and companies, conducting assessments using the P3M3 (Portfolio, Program, and Project Management Maturity Model) to measure their maturity level and even support multiple authorities to measure their maturity level. This certification further validates the commitment to excellence in portfolio, program, and project management."],"images":[{"imageFilename":"ex16_img1_group.jpg","imageCaption":"Group picture for the great team responsible for organizing the first Global Project Managements Forum 2022."},{"imageFilename":"ex16_img2_summit.jpeg","imageCaption":"Group picture for the great team responsible for organizing the first Project Management Offices Summit 2022."},{"imageFilename":"ex16_img3_pmconformances.jpg","imageCaption":"Participating and attending Project Managements Conformances."}],"creditGrid":[]}