{"id":"12","awardCategory":"People Awards","titleBarTitle":"PMI Fellow Award","awardStatus":"Recipient","sidebarTitle":"","sidebarCategory":"PMI Fellow Award","aboutText":"The PMI Fellow Award is the highest and most prestigious individual award presented by Project Management Institute for service to the Institute and the project management profession.","links":[{"linkUrl":"https://www.linkedin.com/in/stevendelgrosso/","linkLabel":"LinkedIn"},{"linkUrl":"https://twitter.com/Steve_DelGrosso","linkLabel":"Twitter / X"}],"team":[],"audioGuide":true,"nextPage":null,"dupeStatus":true,"pageTitle":"Steven DelGrosso","subtitle":"TalosIV, LLC","leadVideo":null,"leadImage":"ex12_hero.jpg","description":["Steven DelGrosso began his career in project management as a project/system engineer at IBM in the 1980s, leading manufacturing process automation projects. He served as IBM’s North American Project Management Profession Leader and was then promoted to Director of the IBM PM Center of Excellence in 2006. He joined PMI and became PMP certified in 1993. Steven served as Director in the PMI Federal Government SIG and a member of the PM Journal Editorial Review Board. He was elected to the PMI Board of Directors in 2010, and served as SDOC Chair (2013), Vice Chair (2014), and Chair in 2015. Steven also served on the PMI Certification Governance Council 2016–2022 and as CGC Chair in 2019. He founded TalosIV, LCC as CEO in 2020 providing project management maturity assessments and Executive Education to commercial and nonprofit organizations globally."],"images":[{"imageFilename":"ex12_img1_japan.jpg","imageCaption":"Project Management strategy update to IBM colleagues in Japan."},{"imageFilename":"ex12_img2_awards.jpg","imageCaption":"Presenting PMI Awards at 2015 Global Congress."},{"imageFilename":"ex12_img3_lacongress.jpg","imageCaption":"Sharing IBM's project management transformation story at PMI Latin American event."},{"imageFilename":"ex12_img4_board.jpg","imageCaption":"Enjoying a few moments away from a PMI Board of Directors meeting."},{"imageFilename":"ex12_img5_transformation.jpg","imageCaption":"Giving some thought to PMI's Transformation."}],"creditGrid":[]}