{"id":"17","awardCategory":"People Awards","titleBarTitle":"PMI Rising Leader Award","awardStatus":"Winner","sidebarTitle":"PMI Rising Leader Award","sidebarCategory":"","aboutText":"The PMI Rising Leader Award (formerly PMI Young Professional Award) recognizes and honors a young professional who has made a significant impact in advancing project management within an organization, advancing the knowledge and understanding of the practice of project management, and demonstrating an understanding of PMI standards, practices and ethics.","links":[{"linkUrl":"https://www.linkedin.com/in/olallagarciaperez/","linkLabel":"LinkedIn"}],"team":[],"audioGuide":true,"nextPage":"","dupeStatus":true,"pageTitle":"Olalla García Pérez","subtitle":"Kawasaki Rail Car","leadVideo":null,"leadImage":"ex17_hero.jpg","description":["Olalla García Pérez (PMP and PMI-ACP) is an industrial engineer from Spain with a specialization in industrial organization and innovation. During her ten years of experience as project manager in the railway sector, she has led international projects in Europe and the United States during the development of onboard systems. In addition, she has been a speaker at different national and international project management conferences where she has shared her knowledge in agile practices and her experience in project management with professionals in the sector. ","The volunteer experiences in which Olalla has participated have been diverse and always focused on project management, digitalization, business strategy, and education. Currently, she is a volunteer in PMI Galicia Spain Chapter helping expand project management knowledge into the community. She is the first Spanish who has been recognized as one of the PMI Future 50 Rising Leaders for driving positive change in sustainable mobility."],"images":[{"imageFilename":"ex17_img1_railway.jpg","imageCaption":"Olalla at Railway Fair in Germany with the first car manufactured."},{"imageFilename":"ex17_img2_oncar.jpg","imageCaption":"On-car system tests."},{"imageFilename":"ex17_img3_germany.jpg","imageCaption":"Olalla at Railway Fair in Germany with the first car manufactured."}],"creditGrid":[]}